dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l43x_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L43x_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L43x_PINMUX_H_)
# define _STM32L43x_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define COMP1_OUT_FUNC           2
#define COMP2_OUT_FUNC           3
#define CRS_SYNC_FUNC            4
#define EVENTOUT_FUNC            5
#define I2C1_SCL_FUNC            6
#define I2C1_SDA_FUNC            7
#define I2C1_SMBA_FUNC           8
#define I2C2_SCL_FUNC            9
#define I2C2_SDA_FUNC            10
#define I2C2_SMBA_FUNC           11
#define I2C3_SCL_FUNC            12
#define I2C3_SDA_FUNC            13
#define I2C3_SMBA_FUNC           14
#define IR_OUT_FUNC              15
#define LCD_COM0_FUNC            16
#define LCD_COM1_FUNC            17
#define LCD_COM2_FUNC            18
#define LCD_COM3_FUNC            19
#define LCD_COM4_FUNC            20
#define LCD_COM5_FUNC            21
#define LCD_COM6_FUNC            22
#define LCD_COM7_FUNC            23
#define LCD_SEG0_FUNC            24
#define LCD_SEG1_FUNC            25
#define LCD_SEG10_FUNC           26
#define LCD_SEG11_FUNC           27
#define LCD_SEG12_FUNC           28
#define LCD_SEG13_FUNC           29
#define LCD_SEG14_FUNC           30
#define LCD_SEG15_FUNC           31
#define LCD_SEG16_FUNC           32
#define LCD_SEG17_FUNC           33
#define LCD_SEG18_FUNC           34
#define LCD_SEG19_FUNC           35
#define LCD_SEG2_FUNC            36
#define LCD_SEG20_FUNC           37
#define LCD_SEG21_FUNC           38
#define LCD_SEG22_FUNC           39
#define LCD_SEG23_FUNC           40
#define LCD_SEG24_FUNC           41
#define LCD_SEG25_FUNC           42
#define LCD_SEG26_FUNC           43
#define LCD_SEG27_FUNC           44
#define LCD_SEG28_FUNC           45
#define LCD_SEG29_FUNC           46
#define LCD_SEG3_FUNC            47
#define LCD_SEG30_FUNC           48
#define LCD_SEG31_FUNC           49
#define LCD_SEG32_FUNC           50
#define LCD_SEG33_FUNC           51
#define LCD_SEG34_FUNC           52
#define LCD_SEG35_FUNC           53
#define LCD_SEG36_FUNC           54
#define LCD_SEG37_FUNC           55
#define LCD_SEG38_FUNC           56
#define LCD_SEG39_FUNC           57
#define LCD_SEG4_FUNC            58
#define LCD_SEG40_FUNC           59
#define LCD_SEG41_FUNC           60
#define LCD_SEG42_FUNC           61
#define LCD_SEG43_FUNC           62
#define LCD_SEG5_FUNC            63
#define LCD_SEG6_FUNC            64
#define LCD_SEG7_FUNC            65
#define LCD_SEG8_FUNC            66
#define LCD_SEG9_FUNC            67
#define LCD_VLCD_FUNC            68
#define LPTIM1_ETR_FUNC          69
#define LPTIM1_IN1_FUNC          70
#define LPTIM1_IN2_FUNC          71
#define LPTIM1_OUT_FUNC          72
#define LPTIM2_ETR_FUNC          73
#define LPTIM2_IN1_FUNC          74
#define LPTIM2_OUT_FUNC          75
#define LPUART1_CTS_FUNC         76
#define LPUART1_DE_FUNC          77
#define LPUART1_RTS_FUNC         78
#define LPUART1_RX_FUNC          79
#define LPUART1_TX_FUNC          80
#define QUADSPI_BK1_IO0_FUNC     81
#define QUADSPI_BK1_IO1_FUNC     82
#define QUADSPI_BK1_IO2_FUNC     83
#define QUADSPI_BK1_IO3_FUNC     84
#define QUADSPI_BK1_NCS_FUNC     85
#define QUADSPI_BK2_IO0_FUNC     86
#define QUADSPI_BK2_IO1_FUNC     87
#define QUADSPI_BK2_IO2_FUNC     88
#define QUADSPI_BK2_IO3_FUNC     89
#define QUADSPI_BK2_NCS_FUNC     90
#define QUADSPI_CLK_FUNC         91
#define RCC_MCO_FUNC             92
#define RTC_OUT_ALARM_FUNC       93
#define RTC_OUT_CALIB_FUNC       94
#define RTC_REFIN_FUNC           95
#define SAI1_EXTCLK_FUNC         96
#define SAI1_FS_A_FUNC           97
#define SAI1_FS_B_FUNC           98
#define SAI1_MCLK_A_FUNC         99
#define SAI1_MCLK_B_FUNC         100
#define SAI1_SCK_A_FUNC          101
#define SAI1_SCK_B_FUNC          102
#define SAI1_SD_A_FUNC           103
#define SAI1_SD_B_FUNC           104
#define SDMMC1_CK_FUNC           105
#define SDMMC1_CMD_FUNC          106
#define SDMMC1_D0_FUNC           107
#define SDMMC1_D1_FUNC           108
#define SDMMC1_D2_FUNC           109
#define SDMMC1_D3_FUNC           110
#define SDMMC1_D4_FUNC           111
#define SDMMC1_D5_FUNC           112
#define SDMMC1_D6_FUNC           113
#define SDMMC1_D7_FUNC           114
#define SPI1_MISO_FUNC           115
#define SPI1_MOSI_FUNC           116
#define SPI1_NSS_FUNC            117
#define SPI1_SCK_FUNC            118
#define SPI2_MISO_FUNC           119
#define SPI2_MOSI_FUNC           120
#define SPI2_NSS_FUNC            121
#define SPI2_SCK_FUNC            122
#define SPI3_MISO_FUNC           123
#define SPI3_MOSI_FUNC           124
#define SPI3_NSS_FUNC            125
#define SPI3_SCK_FUNC            126
#define SWPMI1_IO_FUNC           127
#define SWPMI1_RX_FUNC           128
#define SWPMI1_SUSPEND_FUNC      129
#define SWPMI1_TX_FUNC           130
#define SYS_JTCK_SWCLK_FUNC      131
#define SYS_JTDI_FUNC            132
#define SYS_JTDO_SWO_FUNC        133
#define SYS_JTMS_SWDIO_FUNC      134
#define SYS_JTRST_FUNC           135
#define SYS_TRACECLK_FUNC        136
#define SYS_TRACED0_FUNC         137
#define SYS_TRACED1_FUNC         138
#define SYS_TRACED2_FUNC         139
#define SYS_TRACED3_FUNC         140
#define TIM15_BKIN_FUNC          141
#define TIM15_CH1_FUNC           142
#define TIM15_CH1N_FUNC          143
#define TIM15_CH2_FUNC           144
#define TIM16_BKIN_FUNC          145
#define TIM16_CH1_FUNC           146
#define TIM16_CH1N_FUNC          147
#define TIM1_BKIN_FUNC           148
#define TIM1_BKIN2_FUNC          149
#define TIM1_BKIN2_COMP1_FUNC    150
#define TIM1_BKIN2_COMP2_FUNC    151
#define TIM1_BKIN_COMP1_FUNC     152
#define TIM1_BKIN_COMP2_FUNC     153
#define TIM1_CH1_FUNC            154
#define TIM1_CH1N_FUNC           155
#define TIM1_CH2_FUNC            156
#define TIM1_CH2N_FUNC           157
#define TIM1_CH3_FUNC            158
#define TIM1_CH3N_FUNC           159
#define TIM1_CH4_FUNC            160
#define TIM1_ETR_FUNC            161
#define TIM2_CH1_FUNC            162
#define TIM2_CH2_FUNC            163
#define TIM2_CH3_FUNC            164
#define TIM2_CH4_FUNC            165
#define TIM2_ETR_FUNC            166
#define TSC_G1_IO1_FUNC          167
#define TSC_G1_IO2_FUNC          168
#define TSC_G1_IO3_FUNC          169
#define TSC_G1_IO4_FUNC          170
#define TSC_G2_IO1_FUNC          171
#define TSC_G2_IO2_FUNC          172
#define TSC_G2_IO3_FUNC          173
#define TSC_G2_IO4_FUNC          174
#define TSC_G3_IO1_FUNC          175
#define TSC_G3_IO2_FUNC          176
#define TSC_G3_IO3_FUNC          177
#define TSC_G3_IO4_FUNC          178
#define TSC_G4_IO1_FUNC          179
#define TSC_G4_IO2_FUNC          180
#define TSC_G4_IO3_FUNC          181
#define TSC_G4_IO4_FUNC          182
#define TSC_G5_IO1_FUNC          183
#define TSC_G5_IO2_FUNC          184
#define TSC_G5_IO3_FUNC          185
#define TSC_G5_IO4_FUNC          186
#define TSC_G6_IO1_FUNC          187
#define TSC_G6_IO2_FUNC          188
#define TSC_G6_IO3_FUNC          189
#define TSC_G6_IO4_FUNC          190
#define TSC_G7_IO1_FUNC          191
#define TSC_G7_IO2_FUNC          192
#define TSC_G7_IO3_FUNC          193
#define TSC_G7_IO4_FUNC          194
#define TSC_SYNC_FUNC            195
#define USART1_CK_FUNC           196
#define UART1_CK_FUNC            196
#define USART1_CTS_FUNC          197
#define UART1_CTS_FUNC           197
#define USART1_DE_FUNC           198
#define UART1_DE_FUNC            198
#define USART1_RTS_FUNC          199
#define UART1_RTS_FUNC           199
#define USART1_RX_FUNC           200
#define UART1_RX_FUNC            200
#define USART1_TX_FUNC           201
#define UART1_TX_FUNC            201
#define USART2_CK_FUNC           202
#define UART2_CK_FUNC            202
#define USART2_CTS_FUNC          203
#define UART2_CTS_FUNC           203
#define USART2_DE_FUNC           204
#define UART2_DE_FUNC            204
#define USART2_RTS_FUNC          205
#define UART2_RTS_FUNC           205
#define USART2_RX_FUNC           206
#define UART2_RX_FUNC            206
#define USART2_TX_FUNC           207
#define UART2_TX_FUNC            207
#define USART3_CK_FUNC           208
#define UART3_CK_FUNC            208
#define USART3_CTS_FUNC          209
#define UART3_CTS_FUNC           209
#define USART3_DE_FUNC           210
#define UART3_DE_FUNC            210
#define USART3_RTS_FUNC          211
#define UART3_RTS_FUNC           211
#define USART3_RX_FUNC           212
#define UART3_RX_FUNC            212
#define USART3_TX_FUNC           213
#define UART3_TX_FUNC            213
#define USB_DM_FUNC              214
#define USB_DP_FUNC              215
#define USB_NOE_FUNC             216

